{
  "link": {
    "text": "terms of use",
    "url": "https://developer.dhl.com/terms-use"
  },
  "content": "Skip to main content\nMAIN NAVIGATION\nAPIs \nDocumentation\nHelp Center\nEN \nRegister\nLogin\nTERMS OF USE\n\nTERMS OF USE\n\nINTRODUCTION INTO THE DHL DEVELOPER PORTAL\n\nThank you for joining our Developer Portal. We want to support you when your organization wants to use our technology for crossing borders, and reaching new markets. The Developer Portal gives you access to Services Specifics, content and functionalities. Most of this is available free of charge, subject to the terms & conditions set out below. However, for a limited number of APIs and the corresponding services, we may require a charge.\n\n \n\nGENERAL DEVELOPER PORTAL TERMS OF USE\n\nSUBJECT MATTER, SERVICES SPECIFICS, PROVIDER\n\nSubject Matter - The application programming interfaces (“APIs”), related documentation and/or other relevant material, such as Get Started Docs, User Guides, Release Notes and Legal Terms (“Services Specifics”) and accompanying support services  provided within the Developer Portal facilitate the development of applications that integrate Services of Deutsche Post AG and/or of its affiliates within Deutsche Post DHL Group (“DHL Group”), such as Labelling, Shipment Tracking, Rate Calculator, Location Finder (such services hereinafter referred to as “DHL Services”) into your IT environment (“Your Application”). The application, i.e. including – without limitation – the website, software, or other product that you develop, offer or use integrating DHL’s APIs and the DHL Services, is hereinafter referred to as “Your Application“. “You” or “your” means you if you act as a natural person being older than 18 years, or the entity you are authorized to represent. To support the development of Your Application a testing environment (“Sandbox Environment”) as well as a developer forum (“Forum”) is being provided. The website (www.developer.dhl), the Sandbox Environment and the Forum are jointly referred to as “Developer Portal”. By requesting the API Sandbox Key and/or the API Productive Key you accept the according Services Specifics.\n\nThese Terms of Use and the according Services Specifics do not replace and/or modify the DHL Terms and Conditions of Carriage, any transportation, shipment or warehouse services agreement or other Agreements and/or Terms and Conditions, which govern your DHL shipments and the related shipping/transportation/warehouse services.\n\nProvider - The Developer Portal is made available by Deutsche Post AG, Charles-de-Gaulle-Straße 20, 53113 Bonn and may only be used in accordance with these General Developer Portal Terms of Use (hereinafter “Terms of Use”). The DHL Services that you integrate via API and the according API itself are made available by Deutsche Post AG and/or the according affiliated DHL Group company providing the service as published in the Services Specifics section (“DHL Service Provider”). A reference in these Terms of Use to “we”, “us”, or “our” shall be deemed a reference to Deutsche Post AG as the provider of the Developer Portal and/or the DHL Group company as the responsible DHL Service Provider providing specific DHL Services.\n\n                                                                          \n\nREGISTRATION, ACCOUNT AND API KEYS\n\nRegistration - For using the Developer Portal, you need to create an account by registering and accepting these Terms of Use. You warrant that all your submitted information is accurate and that you will immediately notify us about any amendments in your submitted information. We may reject your registration at our sole discretion. We will confirm your registration by sending you an activation email.\n\nAccount - After the first successful login, you shall select a safe password. You are solely responsible for the confidentiality of your password or other potential login data and protect them from unauthorized access. If you believe an unauthorized person has gained access to your account, you must notify us as soon as possible. Without our prior consent you may not grant third parties access to your account.\n\nAPI Keys - After registration, you may receive upon request a key and a corresponding personal identification number (“API Key”) for each API. The API Keys enable you to use the API and the DHL Services within our Sandbox Environment (“API Sandbox Key”). If you wish to use the API and the DHL Services within a real production environment (“Productive Use”), you need to request additional keys and follow the corresponding on-boarding process (“API Productive Key”). You are solely responsible for the confidentiality of your API (Productive) Keys. You must use the API (Productive) Keys with due care, as sole means of accessing the APIs and not make them available to any third parties.\n\n \n\nRIGHTS OF USE AND RESTRICTIONS\n\nUse of the Developer Portal and the DHL Services\n\nLicense - Unless expressly stated otherwise in the Services Specifics, we grant you a non-exclusive, worldwide, non-transferable, non-sublicensable, royalty free and revocable license to use the Developer Portal in order to develop Your Application and to use the DHL Services in accordance with and under the restrictions stated in these Terms of Use and the Service Specifics.\n\nNo Metadata - You are not entitled to use or store any metadata or algorithms received by us regarding your use of the Developer Portal and DHL Services.\n\nSandbox Environment - You shall use the Sandbox Environment only for testing purposes, not for Productive Use.\n\nOwn risk - The Developer Portal is provided on an “as is” basis. Your use of the Developer Portal is at your own risk. We make no warranties whether implied or otherwise with respect to any information posted by ourselves, our staff or third parties on the Developer Portal, including but not limited to warranty against infringement, quality, accuracy, availability, or fitness for a particular purpose.\n\nInappropriate conduct - You will not post any false, indecent, inappropriate or illegal content, or conduct any inappropriate or illegal activities on our Forum.\n\nNo promotional content - You will not post any advertisements, spam or (links to) promotional content with a commercial interest on our Forum.\n\nDHL Trademarks - All trademarks displayed in the Developer Portal, including but not limited to the following trademarks ‘DHL’, ‘DHL Worldwide Express’, ‘DHL Express’, ‘DHL Parcel’, ‘DHL eCommerce’, ‘DHL Freight’, ‘DHL Supply Chain’, ‘DHL Global Forwarding’, ‘DHL Europlus’, ‘Jumbo Box’, ‘DHL Economy Select’, ‘DHL Jetline’, ‘DHL Sprintline’, ‘DHL Secureline’, ‘DHL Express Easy’, ‘DHL Easy Shop’, ‘DHL Connect’, ‘EasyShip’, are trademarks of DHL International GmbH or any other company of Deutsche Post DHL Group, registered in at least one jurisdiction. No license to use any of these trademarks is given or implied, unless otherwise stipulated in the Services Specifics. These trademarks may not be copied, downloaded, reproduced, used, modified or distributed in any way without prior written permission. In case You want to use any logos and/or trademarks please refer to https://www.dpdhl-brands.com/dpdhl-group/en.html for further instructions and the according consents.\n\nNo Modification - You are not allowed to modify the APIs and/or the DHL Services or data, texts, images, drawings, brands, functionality or any other information or materials you receive in connection with the Developer Portal (“Content”) without our prior written consent, unless required by law.\n\nRestricted Caching/Storing - You will not index, cache or store any Content, unless this is technically necessary, and only if such storage:\n\nis secure in accordance with common industry standards;\nis in accordance with applicable laws;\ndoes not manipulate or modify any part of the Content; and\nis temporary.\n\nYou shall delete the Content as soon as possible after completion of the development of Your Application and/or completion of communication to an end user.\n\nBots, Crawlers - It is prohibited to automate activity via technological means on the Developer Portal and/or an API, i.e. you shall not\n\nuse any automated systems and/or software (including i.a. crawlers, spiders, search-bots, browser plug-ins, extensions, add-ons or other technological means or processes), to access, scrape or modify the Developer Portal and/or the according API or to copy, add, download or retrieve Content from the Developer Portal or an API;\noverride any security measures or bypass or avoid any access controls or call limits of the API and/or the Developer Portal.\n\nNo bulk storage/mass downloads - You shall not store the Content for commercial, non-technical purposes, including mass downloads of any Content, the creation of a database, big data or analytical purposes.\n\nNo other recipients - You shall not disclose the Content to others than to customers addressed by the corresponding DHL Service who reasonably request the Content.\n\nChange of Content - We reserve the right to change our Content from time to time and will notify you about any changes on the Developer Portal or via email in advance. You are responsible for Your Application that may be affected by the changes made to our Content.\n\nOpen Source - Certain elements of the API may contain open source materials which are governed by applicable open source license conditions as specified in the Services Specifics. You agree to comply with such open source license conditions if required.\n\nLimit on API Calls - Each account contains a limit for API calls as further described in the Services Specifics. Additionally, we may limit your amount of API calls due to technical and/or security reasons.\n\nIntellectual Property Rights - All titles, rights and interests to the Developer Portal and its Content including any amendments made thereof are owned by us or our licensor, if any.\n\n \n\nYOUR APPLICATION; PRODUCTIVE USE\n\nProprietary Rights - You will own the intellectual property rights in, or to, Your Application and other results developed by you using the Developer Portal.\n\nRequirements - Prior to and during the entire period of Productive Use of Your Application you are responsible for: (i) the evaluation, testing and fitness of Your Application as to its technology, functionality, performance and security; (ii) compliance with any requirements set out in Services Specifics; and (iii) your successful completion of any technical self-certification process made available by us.\n\nProductive Use - The Productive Use of the APIs and/or the DHL Services requires an API Productive Key.\n\nReview - We reserve the right to review each of Your Applications ourselves or through a subcontractor, but shall not be obliged to conduct such review. Neither any review nor the lack thereof shall constitute an endorsement from us of Your Application. You agree to cooperate with us in the review process and provide information and materials reasonably requested by us, including information on the operation of your business. We may adopt and change our review standards and processes at any time and as we deem appropriate.\n\nRejection/Adaptation - We may reject Your Application or require you to reasonably adapt the functionality of Your Application, at any time even after you have implemented Your Application for Productive Use if we determine: (i) that Your Application does not meet all or any part of the requirements set out in these Terms of Use or any other document referred to herein; or (ii) is not in line with our general business objectives. In case of a rejection you shall refrain from a Productive Use of Your Application until such adaptation has been implemented.\n\nCompetition - Unless otherwise expressly agreed by us in text form Your Application shall not substantially replicate products or services (esp. the DHL Services) offered by us, including, without limitation, functions, features or clients. You shall not, under any circumstances, through applications or otherwise, re-package, copy, recreate or resell DHL Services, or any part thereof, without our prior written consent. We shall have the right to develop and use applications or technical solutions that are similar or otherwise compete with Your Applications. You will not assert an intellectual property or other rights to prevent us from developing or using such technical solutions.\n\nUse Restrictions - When using the Developer Portal, APIs, DHL Service and/or Your Application including DHL data in Productive Use, you shall not or not attempt to:\n\nviolate any laws or (intellectual property) rights of others;\ngain unauthorized access to information or data, which is not yours or intended for your use (e.g. of other API users);\nunder any circumstances repackage, copy, recreate, resell or misuse our APIs, our DHL Services or any of our other services;\nnegatively affect our business activities or reputation;\nperform any security tests (e.g. pen-testing), performance tests (e.g. load-testing), stress tests or similar tests on the Developer Portal, APIs, DHL Services or any component thereof or on any other of our systems,\nreverse engineer, decompile, disassemble or derive source code, underlying ideas, algorithms, structure or organizational form of the Developer Portal or any component thereof or of any of our systems;          \nperform the following actions, hereinafter collectively referred to as “Cyber Attacks”:\nhinder, damage or take any steps which, in our reasonable view, jeopardize the accessibility, functioning or security of the Developer Portal or any component thereof or of any of the APIs and/or DHL Services;\ninterfere with, modify or disable any features, functionality or security controls of the Developer Portal, APIs, DHL Services or any component thereof or of any of our systems;\ndefeat, avoid, bypass, remove, deactivate or otherwise circumvent any protection mechanisms for the Developer Portal, APIs, DHL Services or any component thereof or any of our systems;\nknowingly introduce viruses, trojans, worms, logic bombs or other technologically harmful or malicious materials or perform (distributed) denial-of-service attacks or other hacker attacks;\nillegally procure (e.g. by way of phishing or (social) pharming) and use or deploy user credentials, such as user names, passwords, credit card information;\nengage in corporate espionage in order to retrieve data and/or information (esp. data and/or information representing trade or business secrets) by any of the above actions.\nintegrate DHL’s APIs into Your Application or operate Your Application in a way that third parties or automated systems/software can have direct or indirect unsecured or unauthorised access to DHL’s API’s, DHL Services and/or DHL’s IT systems. In particular, you shall take all necessary technical and (IT-)security measures to prevent third parties or automated systems and/or software from accessing, downloading, retrieving and/or making available Content or DHL Services from DHL’s APIs. If Your Application is a website or mobile application, the above measures shall particularly include the use of bot protection systems, CAPTCHA and/or the monitoring and investigation of traffic spikes.\n\nNotification - If you become aware of any violation of this section or section “RIGHTS OF USE AND RESTRICTIONS” above, you shall immediately notify us and provide us with assistance, as requested by us, to stop, mitigate or remedy the violation.   \n\n \n\nAVAILABILITY, MAINTENANCE AND SUPPORT\n\nAvailability and Maintenance - We will use reasonable efforts to ensure the availability of the Developer Portal, the APIs and/or the DHL Services except during scheduled maintenance windows which will be pre-announced on the Developer Portal or by email in advance. The Developer Portal is deemed available as long as you are able to login to your account and access the API and/or the DHL Services. However, we are under no obligation to provide you with a certain result nor do we warrant availability of the Developer Portal and/or any API and/or the DHL Services for a certain period of time.\n\nTechnical Support - We make reasonable efforts to provide you with technical support to facilitate the use of the Developer Portal, the APIs and/or the DHL Services and will answer reasonable questions as an additional and free service. However, we expect that you have some basic IT knowledge.  We are under no obligation to provide you with a certain result or to reach certain service levels, unless explicitly indicated otherwise.\n\n \n\nCHANGES TO TERMS OF USE, SERVICES SPECIFICS\n\nChanges to Terms of Use, Services Specifics - We reserve the right to amend or modify these Terms of Use and/or the Services Specifics from time to time to reflect, in particular, (i) changes in law; (ii) changes in the Developer Portal, the DHL Services or in any other of our systems imposed or agreed with our subcontractors; (iii) the termination of our relationship with a provider of software and/or services used by us which are material for the provision of the Developer Portal, the DHL Services or any of our systems; (iv) lack of customer acceptance and/or (v) security risks. Changes shall become effective upon the release of a new or updated version. We will inform you about any material changes with prior notice of 30 days on the Developer Portal or via email in advance and you may discontinue use of the Developer Portal and/or the DHL Services prior to the release of a new or updated version. You are deemed to be bound by the new Terms of Use and/or new Services Specifics upon your continued use of the Developer Portal and/or the DHL Services.\n\nChanges to the Developer Portal - We reserve the right to modify the Developer Portal from time to time as we deem necessary. We will notify you of any material changes on our Developer Portal or by email and such changes shall take effect immediately upon notification.\n\n \n\nFEES\n\nDeveloper Portal - We provide the Developer Portal free of charge.\n\nAPI, and/or DHL Services - We reserve the right to charge a fee for the Use of specific APIs and/or the underlying DHL Services. Such fees will be subject to the Services Specifics and/or a separate agreement.\n\n \n\nMONITORING AND AUDIT\n\nMonitoring of Usage - We may monitor your use of the Developer Portal and of the DHL Services for internal business purposes, including, without limitation:\n\nto avoid congestion problems;\nto perform, evaluate and improve the Developer Portal and the DHL Services;\nto check whether Your Application satisfies the requirements as imposed by these Terms of Use or any other document referred to herein;\nif we have reasonable suspicion a violation of laws or the Terms of Use and/or the Services Specifics ;\nif we have reasonable suspicion or fraud or misuse of the Developer Portal, the DHL Services and/or the Productive Use of Your Application.\n\nAudit - We may during regular business hours and upon reasonable advance notice to you conduct an audit to verify your compliance with the Terms of Use and/or the Services Specifics.\n\nThe auditor will be bound to secrecy towards us and may only provide us with information about your compliance with the applicable obligations. You will make available to the auditor all relevant documentation reasonably necessary to facilitate such audit, and permit the auditor to access your facilities and otherwise cooperate with the auditor in any such investigation and will take all commercially reasonable actions to assist the auditor in the audit. If the audit reveals any material non-compliance the costs of the audit will be borne by you, otherwise they will be borne by us.\n\n \n\nTEMPORARY SUSPENSION\n\nOur right to Suspend - We may suspend or limit your use of the Developer Portal or API/DHL Services immediately upon notice if we reasonably determine that there is a material breach of your obligations according to these Terms of Use and/or the Services Specifics or a security incident; or if such suspension or limitation is required by law, a court decision, or a request from a governmental body.\n\nEffect of Temporary Suspension - Your obligation to pay fees remains unaffected. We will notify you of the actions that you must take to reinstate your use of the Developer Portal and/or the DHL Services and to remedy the same within the prescribed period. The suspension or limitation will be lifted as soon as the reason for such suspension or limitation no longer exists. Our right to terminate pursuant to Section “TERM AND TERMINATION” and all other rights and remedies we may have remain unaffected.\n\n \n\nTERM AND TERMINATION\n\nTerm - The use of the Developer Portal subject to theses Terms of Use takes effect upon receipt of the activation email in accordance with Section ”REGISTRATION, ACCOUNT AND API KEYS” and continues until it is terminated or ends otherwise.\n\nTermination for Convenience - We and you may terminate the use of the Developer Portal at any time for convenience. We shall notify you of any termination by us at least 30 days in advance. You shall notify us in writing of any termination by you at least 30 days in advance.\n\nNo Active Use - If you have not logged on to, or otherwise used your account or API-Keys actively within 12 months from activation, we may deactivate or terminate your registration, use of the Developer Portal and/or use of the DHL Services.\n\nTermination for Cause - We may terminate your use of the Developer Portal for cause in case of material breach of the Terms of Use, if such breach remains uncured for a period of 30 days from receipt of notice of the breach by us. Events that entitle us to forthwith terminate the use of the Developer Portal, include without limitation:\n\nacts or omissions that entitle us to a suspension or limitation as per Section “TEMPORARY SUSPENSION” that remain uncured for a continuous period of 60 days from date of suspension;\nour obligation to comply with laws or requests of a governmental body;\na change in control of you and/or your affiliates which, according to our reasonable opinion, adversely affects our position, rights or interests; and\nyour ceasing to operate in the ordinary course, making an assignment for the benefit of creditors or similar disposition of your assets, or becoming the subject of any bankruptcy, reorganization, liquidation, dissolution or similar proceeding.\n\nConsequences of termination - Termination has the following consequences:\n\nwe will block your API Keys and your access/use of the DHL Services;\nwe will block your access to the Developer Portal;\nyou shall immediately remove and delete any Content you possess or control or have implemented into Your Application. We may require you by written notice to send us evidence that you have deleted any Content stored on Your Application.\n\nThe above Sections “Termination for Convenience”, “Termination for Cause” and “Consequences of Termination” shall apply mutatis mutandis to the termination of the API, the DHL Services by us, unless otherwise provided for in the according Services Specifics.\n\n \n\nLIMITED WARRANTY\n\nConformance with Service Standards - We provide the Developer Portal and the APIs/DHL Services materially in accordance with the features and functionalities set out in the Services Specifics. If the Developer Portal, the DHL Service, APIs or any component hereof fail to perform as warranted thereunder, to the extent permissible under applicable laws, our sole obligation and your exclusive remedy will be (i) to use commercially reasonable efforts to restore the non-confirming component of the Developer Portal, the DHL Service and/or the APIs so that it conforms to the warranty, or (ii) if such restoration may not be, in our opinion, available within a reasonable time or with reasonable efforts, to terminate the use of the Developer Portal, the DHL Service or the non-confirming APIs and refund any prepaid amounts for such API (if any). Your right to claim reduction of any fee payable by you shall remain unaffected.\n\nAny further remedies shall be excluded.\n\n \n\nINDEMNIFICATION\n\nIndemnification  - If a third party asserts a claim against you that the Developer Portal, the DHL Service, an API or any component thereof infringes a patent or copyright, we will defend you against or, at our option, settle, such claim and pay amounts finally awarded by a court of competent jurisdiction against you or included in a settlement approved by us provided that you promptly notify us in writing of the claim.\n\nIndemnification by you - You will indemnify us from and against any third party claims for loss or damage of any nature, arising (a) out of your use of the Developer Portal or (b) any access to our systems through Your Application or other Productive Use of Your Application or (c) from any breach by you of these Terms of Use and/or the Services Specifics, unless such claims are the sole result of us not complying with our/its obligations under these Terms of Use and/or the Services Specifics.\n\n \n\nLIMITATIONS AND EXCLUSIONS OF LIABILITY FOR CHARGEABLE OFFERINGS\n\nWhere we enable you to access and use the Developer Portal and/or certain APIs/DHL Services with charge the following provisions apply:\n\nScope of Limitations and Exclusions - The limitations and exclusions in this Section “LIMITATION OF LIABILITY” shall not apply: (i) in cases of willful misconduct and gross negligence; (ii) in cases of bodily injuries or death caused by our, our legal representatives’ or our subcontractors’ negligence; (iii) in cases of fraud or fraudulent misrepresentation; and (iv) in cases liability cannot be limited or excluded according to applicable product liability law.\n\nLimitation of Liability in the event of slight negligence- Notwithstanding Section ”LIMITED WARRANTY” and additional or deviating terms in the Services Specifics, liability for all claims, damages and indemnities caused by slight negligence and arising out of or related to the use of the Developer Portal, a DHL Service and/or any APIs, regardless of the form of action, whether in contract, tort or otherwise, are limited, in the aggregate, to the amount you paid us for the use of the Developer Portal, a DHL Service and/or any APIs (if recurring fees, up to 12 months charges apply). In cases of slight negligence breach of a significant contractual obligation (“Kardinalpflicht”) our liability is limited to the damage or loss which is reasonably foreseeable.\n\nLimitation Period - Any claims against us shall be brought no later than 12 months from knowledge of the event giving rise to the respective claim. Thereafter all claims arising out of that event shall be barred.\n\nLoss of profit etc. - In no event will we be liable for any amounts for loss of production, interruption of operations, contractual claims against you by any Third Party, damage to property, loss or corruption of content, loss of use, loss of interest, income, profit or savings, or indirect, incidental, consequential, exemplary, punitive, or special damages, even if we have been advised of the possibility of such damages in advance, and all such damages are expressly disclaimed. Section “Scope of Limitations and Exclusions” above remains unaffected.\n\nCyber Attacks - We take all reasonable technical and other relevant measures and adhere to the applicable IT security and data protection regulations to exclude Cyber Attacks from the Developer Portal, APIs, the DHL Services or our other IT systems. However, under no circumstances will we be liable for any loss, damage, liability or expense due to (i) a failure or delay of the DHL Services or other of our services and/or obligations caused by Cyber Attacks; (ii) the “infection” of your IT systems (hard- or software) or (iii) loss or damage of data or other proprietary material in connection with your use of the Developer Portal, to your downloading of any Content posted on it or in connection with your Productive Use of the APIs and/or DHL Services. Section “Scope of Limitations and Exclusions” above remains unaffected.\n\nBeneficiaries - Any limitations and exclusions of liability shall also apply to the benefit of any employees, officers, directors, representatives, suppliers, subcontractors, and any person used by us in performing any of our obligations.\n\n \n\nLIMITATIONS AND EXCLUSIONS OF LIABILITY FOR FREE OF CHARGE OFFERINGS\n\nFree of Charge Offering - Where we enable you to access and use the Developer Portal and/or certain APIs/DHL Services free of charge, the limitations under this Section “LIMITATIONS FOR FREE OF CHARGE OFFERINGS” apply in addition to any further limitations set out in these Terms of Use and/or the Services Specifics.\n\nChange, Limitation, Suspension - We may change, limit, or discontinue any free of charge offerings and your access to and use of any free of charge offerings at our sole discretion.\n\nWarranty and Liability - Except to the extent prohibited by applicable laws free of charge offerings are provided “as is” without warranties of any kind and in their then-current version made available by us from time to time without support and availability commitments. We are only liable for claims, damages and indemnities arising out of or related to your use of a free of charge offering in the events of fraudulent or wilful intent and gross negligence. Our liability for claims, damages and indemnities caused by slight negligence is excluded.\n\n \n\nPERSONAL DATA\n\nGeneral - You and we shall comply with the respective obligations under the applicable data protection laws, regulations, statute or ordinances (“Data Protection Laws”), in particular the obligations regulated in the EU General Data Protection Regulation 2016/679 (“GDPR”) and bind their employees engaged in connection with these Terms of Use to data protection in accordance with the Data Protection Laws.\n\n \n\nDHL’s Customer Personal Data - For purposes of these Terms of Use, “DHL’s Customer Personal Data” means DHL’s shipment or other information referring to a DHL customer’s shipment (including but not limited to personal data) and any other similar proprietary information originating from us that is directly transmitted by us via the according API or DHL Service to your Application, even if such information has otherwise been (i) collected by, or stored in Your Application on servers or systems owned or controlled by you or to which you have access; or (ii) which has been provided to a third party (also see section “User being a Third Party Provider”) by a customer or consignee.  \n\n \n\nPersonal Data in relation to use of and access to Developer Portal - Our processing of personal data in relation to the Developer Portal is described in our Privacy Notice.\n\n \n\nUser being a DHL Customer - If you use the DHL Service as a DHL (logistics services) customer the following additionally applies: You and we are independent controllers with regard to the processing of DHL’s Customer Personal Data.\n\n \n\nWe will transfer DHL’s Customer Personal Data to a third party named or authorized by you (e.g., to a transport visibility platform provided by a third party). You confirm and ensure that the necessary data protection requirements between you and the third party for such a data transfer are in place. You acknowledge and agree that you are the responsible data exporter for such requested data transfer. In particular for any transfer of DHL’s Customer Personal Data to a third party outside the European Union, Switzerland, or the United Kingdom (as and if applicable), you shall comply with the applicable Data Protection Laws for international data transfers, including Chapter V of GDPR by using standard contractual clauses adopted by the Commission in accordance with of Article 46(2) GDPR or similar safeguards as laid down in Chapter V of the GDPR, and, to the extent necessary, implement additional contractual, technical and/or organizational safeguards.\n\nYou will have in place procedures and agreements so that any third party, including processors, you authorize to have access to the respective personal data, will respect and maintain the confidentiality and security and comply with applicable requirements of Data Protection Law. We will immediately cease to transfer any DHL’s Customer Personal Data to you (including third parties named or authorized by you) upon your request.\n\n \n\nIn the event of claims of data subjects against us due to a violation of Data Protection Laws by you, you bear the burden of proof that the damage is not in any way the result of any circumstances which are your responsibility, to the extent that personal data of data subjects are being processed by you. As long as you have not given evidence, you undertake to indemnify us on first demand of all claims by third parties if we should suffer damages arising from them.  You agree to indemnify and hold us harmless against any and all losses, costs and expenses (including, without limitation, reasonable attorneys' fees) and liabilities incurred by us in connection with or arising in any manner from your non-performance of the obligations assumed under this section. Furthermore, regarding the transfer of DHL’s Customer Personal Data to a third party expressly requested by you in accordance with the sub-section (“We will transfer…”) above, you will indemnify and hold us harmless against any and all losses, costs and expenses (including, without limitation, reasonable attorneys' fees) and liabilities incurred by us in connection to such processing. The liability stipulations as set out in this section “User being a DHL Customer” shall take precedence over any liability stipulations agreed between the parties.\n\n \n\nUser being a Third Party Provider - If you use the DHL Services as a third party provider (i.e. a software or other technical provider acting on behalf of a mutual customer and/or a consignee of DHL transportation services) the following additionally applies: As between you and us, we will be the sole and exclusive owner of all DHL’s Customer Personal Data.  DHL’s Customer Personal Data is subject to the mandatory legal rights of customers or data subjects under Data Protection Laws, personal data and its derivatives (including those, which may be aggregated or anonymized), regardless of whether DHL’s Customer Personal Data is provided by us, a customer, or a consignee. \n\n \n\nWe acknowledge that you process DHL’s Customer Personal Data in your role as a processor or sub-processor of customer, and only in accordance with customer’s documented instructions. You will not (i) collect, review, analyze, sell, trade, transfer, disclose (other than as required by law), or use in any manner any DHL’s Customer Personal Data; or, (ii) perform or in any manner engage in any data mining activities with respect to any DHL’s Customer Personal Data.  For the avoidance of doubt, and unless otherwise expressly instructed by a customer, you will not provide DHL’s Customer Personal Data relating to one customer to another customer or that customer’s consignees or any other third party, even in aggregated or anonymized form.\n\n \n\nEach party will: (i) comply with Data Protection Laws applicable to its own processing; (ii) obtain all necessary consent(s) from data subjects under all such Data Protection Laws; (iii) work with the other in good faith to address individuals’ data processing complaints or to verify compliance; and (iv) properly configure its network, systems, and applications, and use reasonable security and organizational measures to securely process and store DHL’s Customer Personal Data or other personal data.  For avoidance of doubt, each party is responsible for their respective compliance with Data Protection Laws.\n\n \n\n \n\nCOMMUNICATION\n\nConfidential Information - Any non-public communication disclosed by us or a Deutsche Post DHL affiliate under or in connection with the Developer Portal and which is - when disclosed - identified as “Confidential” or consists of information that, by its nature or context, is sufficient to put you on notice of its confidential nature is considered to be confidential information (“Confidential Information”). In addition, any information and materials obtained by you in connection with these Terms of Use, the Services Specifics or your receipt of APIs and the DHL Services respectively, information regarding our, a Deutsche Post DHL affiliate’s or our or their business partners’ business strategies and practices, methodologies, trade secrets, know-how, pricing, technology, software, application programming interfaces, application programming interface signatures, product plans, and information regarding our or any of Deutsche Post DHL affiliate’s employees, clients, vendors and consultants, are deemed to be Confidential Information.\n\nYour Obligations - You shall:\n\nonly use Confidential Information received for the purpose it was provided to you,\nprevent disclosure of Confidential Information to third parties, and\nrestrict the circulation of Confidential Information only to users, employees, affiliates, business partners and advisors, and the respective employees of such affiliates, business partners and advisors who are bound to appropriate confidentiality obligations and who need to know that information for the use of the Developer Portal and/or the APIs and the DHL Services respectively.\n\nExceptions - Confidential Information does not include information that:\n\nbecomes part of the public domain without violation of these Terms of Use;\ncan be proven known and on record at the receiving party prior to the first disclosure of the Confidential Information, provided that the receiving party has no reason to believe that such source is itself bound by a confidentiality obligation or that such source has obtained the information through any wrongful or tortious conduct;\nwas lawfully in the receiving party’s possession prior to receipt from the other party without a corresponding obligation of confidentiality;\ncan be proven to have been independently developed.\n\nCompelled Disclosure - We will not disclose Confidential Information and/or any of your content to any third party except (i) as instructed by you, (ii) as permitted in these terms, (iii) as required by laws or governmental order.\n\nFeedback - If you communicate to us any comments, ideas, suggestions or other feedback (“Feedback”) regarding the Developer Portal, we are entitled to use your Feedback free of charge, worldwide and without any other restriction in order to improve our Developer Portal or APIs or the respective DHL Services.\n\nPublicity - You shall not without prior written consent of us or the according Deutsche Post DHL affiliate use our or any of our affiliate’s name or logo in any sales or marketing materials or any part hereof in any way.\n\n \n\nEXPORT CONTROL AND SANCTIONS COMPLIANCE\n\nExport, Sanctions and Customs Laws - Export control, sanctions and customs laws and regulations apply to the provision of services by DHL, and your access to and use of the API Developer Portal or any other DHL systems.  \n\nYour Obligations - You agree to comply fully with all UN, EU, US and other applicable export control and sanctions laws and regulations and, where applicable, local customs laws (collectively “Trade Laws”). You represent that you (and any company, entity, or third party on whose behalf you are engaged) are not listed on any applicable sanctions lists as a denied or restricted party.  You are obliged: (i) to deny and prevent access to the Developer Portal or to our systems through Your Applications from any location subject to broad comprehensive sanctions or embargoes under UN, EU, or US law; (ii) to continuously screen all of your customers and any users against applicable denied or restricted party lists; (iii) to deny or prevent access to the Developer Portal or to our systems through Your Applications to any individual or entity designated on any of these lists; (iv) to ensure and warrant, that you, your beneficial owner or any holding company, the consignee or any third party contracted by you directly or indirectly in conjunction with the API Services provided by DHL, are not listed on any applicable sanctions list as a restricted or denied party. As far as services provided by DHL are concerned that are subject to applicable local customs laws or Prohibitions & Restrictions, you agree (i) to provide true, complete and accurate information (if you identify errors or inaccuracies, you shall promptly notify us of the error/inaccuracy) and (ii) that, unless specified by a separate agreement in writing, we do not serve for or on behalf of you as Exporter for export control purposes, Exporter or Importer for customs purposes, indirect representative or applicant or holder of any authorizations, licenses or permits related to applicable Trade Laws on the import, export, transit or transfer of goods, including technology and software. \n\nInformation Requirements - If required to enable authorities or us – including any Deutsche Post DHL affiliate – to conduct export control, sanctions or, where applicable and required, customs compliance checks, you, upon request by us or the according Deutsche Post DHL affiliate, shall promptly provide us with all relevant information pertaining to the particular destination, end user, ECN, encryption byte levels, and particular intended use of the Developer Portal, Your Application, the APIs or the DHL Services including information on you, your customers and users, and all information related to customs compliance\n\nRight to Withhold Performance, Indemnification - We shall not be obligated to perform our service in connection with the Developer Portal, an API or a DHL Service under these Terms of Use if you breach these obligation or performance is prohibited by applicable Trade Laws.  You further acknowledge that we may be obliged under Trade Laws to limit or suspend use or access by you and/or users to the Developer Portal, an API, a DHL Service or to any other of our systems. In the case of a breach of the obligations set forth in this section, you shall indemnify and hold us harmless from any claims, penalties and fees that arise or result from such a breach.\n\n \n\nTRADE COMPLIANCE\n\nExport Controls, Sanctions, and Customs Laws - Export controls, economic sanctions, and customs laws and regulations apply to the provision of services by DHL, and your access to and use of the API Developer Portal or any other DHL systems.  \n\nYour Obligations - You agree to comply fully with all UN, EU, US, UK, and other applicable export controls and economic sanctions laws and regulations and, where applicable, local customs laws (collectively, “Trade Laws”). You represent and warrant that you (and any company, entity, or third party on whose behalf you are engaged) are not listed on any applicable sanctions lists as a denied or restricted party.  You agree and are obliged: (i) to deny and prevent access to the Developer Portal or to our systems through Your Applications from any location subject to broad comprehensive sanctions or embargoes under applicable Trade Laws; (ii) to continuously screen all of your customers and users against applicable denied or restricted party lists (“Denied Party Lists”); (iii) to deny or prevent access to the Developer Portal or to our systems through Your Applications to any individual or entity designated on any Denied Party Lists or owned or controlled by a person designated on any Denied Party List; (iv) to ensure and warrant, that you, your beneficial owner or holding company, and your or their respective directors, officers or employees, the consignee or any third party contracted by you directly or indirectly in conjunction with the usage of API Services provided by DHL, are not listed on any Denied Party Lists; (v) to secure that no software, technology or data owned or controlled by you or by third parties contracted by or acting on your behalf, which is subject to prohibitions or restrictions under applicable Trade Laws, is used, re-/exported, transferred, or accessed without applicable export license, authorization or permit from relevant government  authorities; and (vi) notify DHL immediately in writing if one or more of the aforementioned requirements cannot be ensured by you.\n\nAs far as services provided by DHL are concerned that are subject to applicable local customs laws or Prohibitions & Restrictions, you agree (i) to provide true, complete and accurate information (if you identify errors or inaccuracies, you shall promptly notify us of the error/inaccuracy) and (ii) that, unless specified by a separate agreement in writing, we do not serve for or on behalf of you as Exporter for export control purposes, Exporter or Importer for customs purposes, indirect representative or applicant or holder of any authorizations, licenses or permits related to applicable Trade Laws on the import, export, transit or transfer of goods, including technology and software. \n\nInformation Requirements - If required to enable authorities or us – including any Deutsche Post DHL affiliate – to conduct export control, sanctions or, where applicable and required, customs compliance checks, you, upon request by us or the according Deutsche Post DHL affiliate, shall promptly provide us with all relevant information pertaining to the particular destination, end user, ECCN, encryption byte levels, and particular intended use of the Developer Portal, Your Application, the APIs or the DHL Services including information on you, your customers and users, and all information related to customs compliance.  You will promptly notify DHL in writing if you, your beneficial owner or holding company, or any of your directors, officers, employees becomes designated on a Denied Party List at any point in time.  \n\nRight to Withhold Performance, Indemnification - We shall not be obligated to perform our service in connection with the Developer Portal, an API or a DHL Service under these Terms of Use if you breach these obligations or performance is prohibited by applicable Trade Laws.  \n\nTo the extent permitted by law, you agree to indemnify and hold harmless DHL against any damages, claims and costs by any third party, including but not limited to attorney fees and any fines or penalties from relevant authorities, arising in connection with any termination of this Agreement which result from any violation by DHL of Sanctions Laws or Export Control Laws, caused by your negligent breach of this provision.\n\nYou further acknowledge that we may be obliged under Trade Laws to limit or suspend use or access by you and/or users to the Developer Portal, an API, a DHL Service or to any other of our systems. In the case of a breach of the obligations set forth in this section, you shall indemnify and hold us harmless from any claims, penalties and fees that arise or result from such a breach.\n\n \n\nMISCELLANEOUS\n\nNo Partnership - For all purposes, the parties will be deemed to be independent contractors and nothing in these Terms of Use will be construed as creating a partnership, franchise, agency, fiduciary, employment or joint venture relationship of any kind between the parties. You nor we will have the authority to bind the other party or to contract in the name of or create a liability against the other party in performing its obligations or exercising its rights under these Terms of Use.\n\nAssignment - You may not assign any of your rights or obligations under these Terms of Use without our prior written approval. We may assign these Terms of Use or any right granted there into any of our affiliates that assume our obligations.\n\nSet-off, Retention - You may only set off claims or assert a right of retention with regard to claims that are uncontested by us, are ready for decision or have been confirmed by final court judgment.\n\nForce Majeure - Neither us nor our partners, affiliates and employees shall be liable for any failure or delay relating to your use of the Developer Portal, the APIs, the DHL Services and/or any failure or delay of underlying IT systems used by us to perform our contractual or other obligations due to any external cause beyond our reasonable control, i.e. which is inescapable despite the application of ultimate care (äußerste Sorgfalt), including acts of God, earthquake, fire, flood, embargo, riot, sabotage, Cyber Attacks, labor shortage or dispute, acts or omissions of civil or military authorities, war, acts of sabotage or terrorism.\n\nSeverity - If any provision of these Terms of Use is held to be invalid, illegal or unenforceable, the validity, legality and enforceability of the remaining provisions will not in any way be affected or impaired, and - in case you are not a consumer - such provision will be deemed to be restated to reflect the original intentions of the Parties as nearly as possible in accordance with applicable law.\n\nSubcontracting - To support the rendering of the Developer Portal, we may use personnel and resources in various countries, including subcontractors.\n\nOrder of Precedence - In the event of a conflict or inconsistency the regulations and/or documents prevail in the following descending order:\n\nServices Specifics\nGeneral Developer Portal Terms of Use\n\n \n\nGOVERNING LAW\n\nGoverning Law - These Terms of Use are governed by German law. The Legal Terms for the DHL Services may be governed by a different law and/or jurisdiction as set out in the Services Specifics.\n\n \n\nFind Content\nSearch\nSearch\nAPIs of our divisions\nDHL eCommerce\nDHL Express\nDHL Global Forwarding\nDHL Freight\nDHL Supply Chain\nPost & Parcel Germany\nDevelopers\nAPI Catalog\nDocumentation\nAPI Status\nFOOTER MENU\nImprint\nPrivacy Notice\nTerms of Use\nCookie Settings\n2024 © DHL International GmbH. All rights reserved.\nPrivacy Preference Center\n\"Cookies\" are small files that enable us to store information related to your device and you, the user, specifically, while you visit one of our websites. Cookies help us to determine how frequently our internet pages are accessed as well as the number of users. And they help us configure our offers so that they are as convenient and efficient as possible for you. Privacy Notice\nAccept All\nConfirm Selection\nManage Consent Preferences\nStrictly Necessary Cookies\nAlways Active\n\nThese cookies are used to ensure that our website operates correctly and they cannot be deactivated in your systems.\n\nCookies Details‎\nPerformance Cookies\n\nThese cookies collect information about the way our website is used, such as the Internet browser and operating system used, domain name of the website from which you accessed our site, number of visits, average time spent on the site and pages viewed.\n\nCookies Details‎\nFunctional Cookies\n\nThese cookies allow the website to remember choices you make and provide enhanced, more personal features. For example, these cookies can be used to remember and store the last tracking number that you entered when using a tracking application. Information these cookies collect may be anonymized and they cannot track your browsing activity on other websites.\n\nCookies Details‎\nAnalytics Cookies\n\nWe use analytical cookies to improve the quality of our website and its content, and to ensure that our partners’ embedded services work properly.\n\nCookies Details‎\nConfirm Selection",
  "requirements": {
    "api key": 1
  },
  "pageLinks": [
    {
      "text": "skip to main content",
      "url": "https://developer.dhl.com/terms-use#main-content"
    },
    {
      "text": "",
      "url": "https://developer.dhl.com/"
    },
    {
      "text": "api developer portal",
      "url": "https://developer.dhl.com/"
    },
    {
      "text": "",
      "url": "https://developer.dhl.com/search"
    },
    {
      "text": "apis",
      "url": "https://developer.dhl.com/api-catalog"
    },
    {
      "text": "tracking apis",
      "url": "https://developer.dhl.com/api-catalog?f%5B0%5D=api_catalog_service%3A3"
    },
    {
      "text": "shipping apis",
      "url": "https://developer.dhl.com/api-catalog?f%5B0%5D=api_catalog_service%3A40"
    },
    {
      "text": "browse all services",
      "url": "https://developer.dhl.com/api-catalog"
    },
    {
      "text": "documentation",
      "url": "https://developer.dhl.com/documentation"
    },
    {
      "text": "help center",
      "url": "https://developer.dhl.com/help-center"
    },
    {
      "text": "de",
      "url": "https://developer.dhl.com/terms-use?lang=de"
    },
    {
      "text": "en",
      "url": "https://developer.dhl.com/terms-use?lang=en"
    },
    {
      "text": "ja",
      "url": "https://developer.dhl.com/terms-use?lang=ja"
    },
    {
      "text": "ko",
      "url": "https://developer.dhl.com/terms-use?lang=ko"
    },
    {
      "text": "th",
      "url": "https://developer.dhl.com/terms-use?lang=th"
    },
    {
      "text": "zh-hans",
      "url": "https://developer.dhl.com/terms-use?lang=zh-hans"
    },
    {
      "text": "zh-hant",
      "url": "https://developer.dhl.com/terms-use?lang=zh-hant"
    },
    {
      "text": "register",
      "url": "https://developer.dhl.com/user/register"
    },
    {
      "text": "login",
      "url": "https://developer.dhl.com/user/login?destination=/node/23"
    },
    {
      "text": "",
      "url": "https://developer.dhl.com/search"
    },
    {
      "text": "register",
      "url": "https://developer.dhl.com/user/register"
    },
    {
      "text": "login",
      "url": "https://developer.dhl.com/user/login?destination=/node/23"
    },
    {
      "text": "",
      "url": "https://developer.dhl.com/search"
    },
    {
      "text": "",
      "url": ""
    },
    {
      "text": "www.developer.dhl(link is external)",
      "url": "https://developer.dhl/"
    },
    {
      "text": "https://www.dpdhl-brands.com/dpdhl-group/en.html(link is external)",
      "url": "https://www.dpdhl-brands.com/dpdhl-group/en.html"
    },
    {
      "text": "privacy notice",
      "url": "https://developer.dhl.com/privacy-notice"
    },
    {
      "text": "denied party lists",
      "url": ""
    },
    {
      "text": "dhl ecommerce",
      "url": "https://developer.dhl.com/dhl-ecommerce"
    },
    {
      "text": "dhl express",
      "url": "https://developer.dhl.com/dhl-express"
    },
    {
      "text": "dhl global forwarding",
      "url": "https://developer.dhl.com/dhl-global-forwarding"
    },
    {
      "text": "dhl freight",
      "url": "https://developer.dhl.com/dhl-freight"
    },
    {
      "text": "dhl supply chain",
      "url": "https://developer.dhl.com/dhl-supply-chain"
    },
    {
      "text": "post & parcel germany",
      "url": "https://developer.dhl.com/post-and-parcel-germany"
    },
    {
      "text": "api catalog",
      "url": "https://developer.dhl.com/api-catalog"
    },
    {
      "text": "documentation",
      "url": "https://developer.dhl.com/documentation"
    },
    {
      "text": "api status",
      "url": "https://status.api.dhl.com/"
    },
    {
      "text": "imprint",
      "url": "https://developer.dhl.com/imprint"
    },
    {
      "text": "privacy notice",
      "url": "https://developer.dhl.com/privacy-notice"
    },
    {
      "text": "terms of use",
      "url": "https://developer.dhl.com/terms-use"
    },
    {
      "text": "cookie settings",
      "url": "https://developer.dhl.com/terms-use#cookiepref"
    },
    {
      "text": "privacy notice",
      "url": "https://www.dhl.com/global-en/home/footer/global-privacy-notice.html"
    },
    {
      "text": "cookies details‎",
      "url": "javascript:void(0)"
    },
    {
      "text": "cookies details‎",
      "url": "javascript:void(0)"
    },
    {
      "text": "cookies details‎",
      "url": "javascript:void(0)"
    },
    {
      "text": "cookies details‎",
      "url": "javascript:void(0)"
    },
    {
      "text": "",
      "url": "https://onetrust.com/poweredbyonetrust"
    },
    {
      "text": "back buttonback",
      "url": "javascript:void(0)"
    },
    {
      "text": "filter icon",
      "url": "javascript:void(0)"
    },
    {
      "text": "clear filters",
      "url": "javascript:void(0)"
    },
    {
      "text": "view privacy notice",
      "url": "https://developer.dhl.com/terms-use#"
    },
    {
      "text": "require opt-out",
      "url": "https://developer.dhl.com/terms-use#"
    },
    {
      "text": "",
      "url": "https://onetrust.com/poweredbyonetrust"
    },
    {
      "text": "privacy notice",
      "url": "https://www.dhl.com/global-en/home/footer/global-privacy-notice.html"
    }
  ]
}
