{
  "link": {
    "text": "virtualization guide",
    "url": "https://developer.fedex.com/api/en-us/guides/sandboxvirtualization.html"
  },
  "content": "FedEx Developer Portal will experience interruption from 07/13/2024, 9:00 PM CT - 07/14/2024, 2:00 AM CT.\nWe apologize for any inconvenience such as slow response or technical difficulties. Thank you for your patience!\n\nMenu\n Developer Portal\n\nAPI Sandbox Virtualization Customer Education\n\nWhat is Sandbox Virtualization?\n\nAPI Sandbox Virtualization is a service that simulates the behavior of a live sandbox instance. Our virtualized service provides a consistent experience where the response you receive is predefined and does not always vary based on the specific input values you provide.\n\nHere is an example. Let's say you make multiple calls with the same rate request, changing sender and recipient locations with each test. The API will return the same predefined rate reply regardless of the address changes. Although the values may not match, the structure of the reply would simulate what you would receive in the live environment.\n\nSince the virtualized service does not hit the live backend system components, your integration testing is protected from backend dependencies while you still get the appropriate response.\n\nWhy is FedEx Sandbox Virtualized?\n\nIn complex, interdependent system such as FedEx, unfortunately there are a few instances when a dependent resource becomes unavailable and system availability suffers. When such incidents occur, even though they are remote, it could adversely impact your API integration testing. There are other constraints in live instances that could also restrict the extent of your integration testing. Examples include.\n\nShipping account not having required access to test certain specific scenario.\nLimited test data availability.\nPlanned or unplanned system downtime.\n\nHow can you use Virtualized Sandbox instance?\n\nFamiliarize yourself with the API documentation, endpoints, and authentication method. This will help in designing effective tests.\nDownload and familiarize yourself with the JSON API collection provided under the API documentation.\nPick and test sample transactions that fit your usage scenarios. For a consistent experience avoid changing the request payload structure so that you receive the virtualized response.\nPlease note that not all input values will affect the response. Instead, focus on understanding how your application handles the consistent responses.\nTest all APIs for correct behavior according to the documentation. Include both positive and negative test cases.\nUse the provided negative test cases to understand how error messages, and status codes are returned. This will help in determining how your application should manage errors. Refer JSON API collection & the test cases with the prefix added as “Negative”.\n\nBenefits of virtualization\n\nLess chances of resource unavailability.\nLess test data dependency.\nFaster response when compared to live sandbox instance.\nNo explicit account level access required for the special services.\nSeamless integration experience easing the process of testing & certification.\n\nFAQs\n\nHow would I get the request payload to hit the virtualized response?\nEach API documentation have the JSON API Collection being provided.Visit the API catalog & open the documentation for API. Look at the section for “JSON API Collection” in the API documentation. This JSON API collection has all the request payloads saved which would retrieve the virtualized response.\nDo I need to get the token to access the Virtualized sandbox instance?\nYes, the token generation and authorization are going to work as they are, and you are expected to pass the token for every transaction that interacts with the virtualized sandbox service.\nHow would I know if the response is returned from virtualized service?\nThe virtualized response would have below alert added as part of the payload.\n\n\nIn Rate & Transit Times API, why is my address in the request payload not being validated?\nAddress validation is not part of logic that derives a virtualized rate response. Only country is validated so you can pass any value in rest of the address fields.\nAre all APIs virtualized?\nOnly the following APIs have been virtualized to date. Work is in progress to virtualize the rest of the API capabilities.\nRate & Transit Times API\tVirtualized\nTrack API\tVirtualized\nFreight LTL API – Rate & Pickup Capability\tVirtualized\nAddress Validation API\tVirtualized\nPostal Code Validation API\tVirtualized\nPickup Request API\tVirtualized\nService Availability API\tVirtualized\nGlobal Trade API\tVirtualized\nGround End of Day Close API\tVirtualized\nOpen Ship API\tVirtualized\nShip API\tVirtualized\nFedEx Location Search API\tVirtualized\n\nAre you an existing Web Services or FedEx Ship Manager Server Customer? If so, you can still access the Developer Resource Center.\n\n © FedEx Corporate Services Inc. All rights reserved.\nIntegration Solutions Support FedEx.com Terms of Use Security & Privacy\n United States \nEnglish",
  "requirements": {},
  "pageLinks": [
    {
      "text": "",
      "url": ""
    },
    {
      "text": "",
      "url": ""
    },
    {
      "text": "developer portal",
      "url": ""
    },
    {
      "text": "sign up or log in",
      "url": "https://developer.fedex.com/api/en-us/guides/sandboxvirtualization.html#"
    },
    {
      "text": "sign up or log in",
      "url": ""
    },
    {
      "text": "getting started",
      "url": "https://developer.fedex.com/api/en-us/get-started.html"
    },
    {
      "text": "api catalog",
      "url": "https://developer.fedex.com/api/en-us/catalog.html"
    },
    {
      "text": "guides",
      "url": "https://developer.fedex.com/api/en-us/guides.html"
    },
    {
      "text": "announcements",
      "url": "https://developer.fedex.com/api/en-us/announcements.html"
    },
    {
      "text": "api certification",
      "url": "https://developer.fedex.com/api/en-us/certification.html"
    },
    {
      "text": "api status",
      "url": "https://developer.fedex.com/api/en-us/dashboard.html"
    },
    {
      "text": "support",
      "url": "https://developer.fedex.com/api/en-us/support.html"
    },
    {
      "text": "other products",
      "url": ""
    },
    {
      "text": "fedex web services®",
      "url": "https://www.fedex.com/en-us/developer/web-services.html"
    },
    {
      "text": "fedex ship manager®  server",
      "url": "https://www.fedex.com/en-us/developer/ship-manager-server.html"
    },
    {
      "text": "guides",
      "url": "https://developer.fedex.com/api/en-us/guides.html"
    },
    {
      "text": "api catalog",
      "url": "https://developer.fedex.com/api/en-us/catalog.html"
    },
    {
      "text": "developer resource center",
      "url": "https://www.fedex.com/en-us/developer.html"
    },
    {
      "text": "integration solutions",
      "url": "https://www.fedex.com/en-us/integration.html"
    },
    {
      "text": "support",
      "url": "https://www.fedex.com/en-us/integration/support.html"
    },
    {
      "text": "fedex.com",
      "url": "https://www.fedex.com/en-us/home.html"
    },
    {
      "text": "terms of use",
      "url": "https://www.fedex.com/en-us/terms-of-use.html"
    },
    {
      "text": "security & privacy",
      "url": "https://www.fedex.com/en-us/trust-center.html"
    },
    {
      "text": "united states",
      "url": ""
    },
    {
      "text": "english",
      "url": "https://developer.fedex.com/api/en-us/guides/sandboxvirtualization.html"
    },
    {
      "text": "spanish",
      "url": "https://developer.fedex.com/api/es-us/guides/sandboxvirtualization.html"
    },
    {
      "text": "",
      "url": "https://developer.fedex.com/api/en-us/guides/sandboxvirtualization.html#"
    },
    {
      "text": "contact support",
      "url": "https://developer.fedex.com/api/en-us/support.html"
    },
    {
      "text": "",
      "url": "https://developer.fedex.com/api/en-us/home.html"
    }
  ]
}
