{
  "link": "https://stackoverflow.com/help",
  "content": "Skip to main content\nStack Overflow\nProducts\nLog in\nSign up\n The 2024 Developer Survey results are live!\nSee the results\nHelp center\nSearch\nWelcome to the Stack Overflow Help Center!\n\nIf you are unable to find the answer you need here, you can also search for or ask a question about Stack Overflow on Meta Stack Overflow!\n\nWe have a curated list of frequently asked questions. Top FAQ questions include:\nWhat can I do when getting “We are no longer accepting questions/answers from this account”?\nHow do I ask and answer homework questions?\nWhy did I gain/lose reputation? Can I audit my reputation history?\n\"This question already has answers here\" - but it does not. What can I do when I think a question is not a duplicate?\nAI-assisted Generated Content Ban\n\nPlease be aware that all AI-assisted generated content (including ChatGPT) is currently banned. For more information, see:\n\nWhy can't I use Artificial Intelligence tools to generate answers?\nPolicy: Generative AI (e.g., ChatGPT) is banned\nFind out more about…\nAsking\n What types of questions should I avoid asking?\n What topics can I ask about here?\n What does it mean if a question is \"closed\"?\nWhat should I do if no one answers my question?\nI've thought better of my question; can I delete it?\n» View more\nOur model\n Code of Conduct\n Expected Behavior\n How do I use tags to find topics I'm interested in?\nHow do I delete all my contributions?\nWhat is this site’s policy on content generated by generative artificial intelligence tools?\n» View more\nReputation & Moderation\n Who are the site moderators, and what is their role here?\n Why is voting important?\n What is reputation? How do I earn (and lose) it?\nWhy do I have a reputation change on my reputation page that says 'User was removed'?\nWhat are declined flags, and what should I do about them?\n» View more\nAnswering\n How do I write a good answer?\n What does it mean when an answer is \"accepted\"?\nWhy and how are some answers deleted?\nHow to reference material written by others\nWhy can I only answer once every 30 minutes?\n» View more\nBadges\nView a full list of badges you can earn\nPrivileges\nView a full list of privileges you can earn\nMy Account\n I accidentally created two accounts; how do I merge them?\n How do I add or remove login credentials from my account?\n I lost my password; how do I reset it?\n How do I delete my account?\nHow do I access a data dump for a Stack Exchange site?\n» View more\nReview Queues\n What are review queues?\nHow do I use the First answers queue?\nHow do I use the Close votes queue?\nHow do I use the Reopen votes queue?\nHow do I use the Low quality posts queue?\n» View more\nCollectives on Stack Overflow\n What is Collectives on Stack Overflow?\n Article guidelines\nWhat are the different types of users in a collective?\nWhat happens when a provider-focused collective transitions to become a topic-focused collective?\nWhat happens when a collective is decommissioned?\n» View more\nStaging Ground\n What is the Staging Ground?\nGuidelines and best practices for reviewers on the Staging Ground\n» View more\nDiscussions\n What is the Discussions feature, and how does it work?\n Discussions guidelines\nWho are the Discussions moderators and what do they do?\n» View more\nStack Overflow Jobs\nFrequently Asked Questions\nHow to Report a Listing on Stack Overflow Jobs\n» View more\nSTACK OVERFLOW\nQuestions\nHelp\nChat\nPRODUCTS\nTeams\nAdvertising\nCollectives\nTalent\nCOMPANY\nAbout\nPress\nWork Here\nLegal\nPrivacy Policy\nTerms of Service\nContact Us\nCookie Settings\nCookie Policy\nSTACK EXCHANGE NETWORK\nTechnology\nCulture & recreation\nLife & arts\nScience\nProfessional\nBusiness\nAPI\nData\nBlog\nFacebook\nTwitter\nLinkedIn\nInstagram\n\nSite design / logo © 2024 Stack Exchange Inc; user contributions licensed under CC BY-SA. rev 2024.7.31.13445"
}
