{
  "link": "https://stackoverflow.com/help/gen-ai-policy",
  "content": "Skip to main content\nStack Overflow\nProducts\nLog in\nSign up\n The 2024 Developer Survey results are live!\nSee the results\nHome\nQuestions\nTags\nUsers\nCompanies\nLABS\nJobs\nDiscussions\nCOLLECTIVES\n\nCommunities for your favorite technologies. Explore all Collectives\n\nTEAMS\n\nNow available on Stack Overflow for Teams! AI features where you work: search, IDE, and chat.\n\nLearn more Explore Teams\nStack Overflow\nHelp center\nOur model\nWhat is this site’s policy on content generated by generative artificial intelligence tools?\n\nGenerative artificial intelligence (a.k.a. GPT, LLM, generative AI, genAI) tools may not be used to generate content for Stack Overflow. The content you provide must either be your own original work, or your summary of the properly referenced work of others. If your content is determined to have been written by generative artificial intelligence tools, it will likely be deleted, along with any reputation earned from it. Posting content generated by generative artificial intelligence tools may lead to a warning from moderators, or possibly a suspension for repeated infractions.\n\nWhat counts as “content generated by generative artificial intelligence tools”?\n\n“Content generated by generative artificial intelligence tools” is any content crafted, in part or in whole, using a tool that writes a response automatically based on a prompt it is provided. These tools include large language models like ChatGPT and Google Gemini. Because these tools are trained to answer with language that matches authentic text, the responses may look and sound plausible, but the quality of generated answers can vary significantly (up to, and including, completely wrong answers).\n\nPlease do not draft content for Stack Overflow using large language model (LLM) services as described above.\n\nWhy am I not allowed to use generative artificial intelligence services to draft my content?\n\nStack Exchange is a collaborative resource, developed and maintained by members of the community. There are a few primary issues with content generated by large language models that makes it unsuitable for use on Stack Overflow:\n\nUsers who ask questions on Stack Overflow expect to receive an answer authored and vetted by a human. This ensures that the answer is factual, relevant, and complete, up to the standards of another human. While human authors are not perfect, generative artificial intelligence tools may not take into account other important factors to a question (e.g., optimization, security, etc.), often add excessive noise to their answers (e.g., explaining all details, no matter how relevant), and may fabricate false or misleading information.\nUsers who ask questions on Stack Overflow may have already sought answers elsewhere. Due to the ease of using generative artificial intelligence services, if a user wanted an answer from an artificial intelligence, they may already have sought one, and so it does not make sense to provide one here.\nGenerative artificial intelligence tools are not capable of citing the sources of knowledge used up to the standards of the Stack Exchange network. Even when generative artificial intelligence tools appear to cite sources for responses, such sources may not be relevant to the original request, or may not exist at all. For Stack Overflow, this means the content may not honestly or fairly represent the sources of knowledge used, even if someone explicitly cites the generative artificial intelligence tool as an author in their content.\nAre there alternatives to using generative artificial intelligence services?\n\nMany of the answers on Stack Overflow are created by users sharing their own expertise. In particular, when supplying answers outside their expertise, users should reference trustworthy sources. Searching for sources, synthesizing them into a good answer, and referencing them clearly are critical steps in developing a well-crafted answer.\n\nRemember - the person who asked a question needs a correct answer. As such, answering correctly is always more important than answering quickly. Additionally, our system thrives on questions getting multiple good answers, which are more likely to help future visitors who have the same question. By following a process that creates consistently correct answers of good quality, and that are well-referenced as needed, you should do just fine here.\n\nAsking\nPrivileges\nBadges\nOur model\nCode of Conduct\nExpected Behavior\nHow do I use tags to find topics I'm interested in?\nHow do I delete all my contributions?\nWhat is this site’s policy on content generated by generative artificial intelligence tools?\nWhat are badges?\nHow do I format my posts using Markdown or HTML?\nCan I support my product on this site?\nWhat does \"beta\" mean?\nWhy can people edit my posts? How does editing work?\nHow do I search?\nHow does the User Card popup work?\nThe Community user deleted my question! What gives?\nWhat if I see someone doing something bad?\nHow to not be a spammer\nWhat is Flair?\nWhat is \"meta\"? How does it work?\nHow do I report harassment?\nWhere can I post feedback about something that’s broken or an idea I have for a feature?\nWhat if I need more help?\nWhat should a tag wiki excerpt contain?\nHow do I advertise on Stack Overflow?\nWhat browsers do we support?\nReputation & Moderation\nAnswering\nMy Account\nReview Queues\nCollectives on Stack Overflow\nStaging Ground\nDiscussions\nStack Overflow Jobs\nSTACK OVERFLOW\nQuestions\nHelp\nChat\nPRODUCTS\nTeams\nAdvertising\nCollectives\nTalent\nCOMPANY\nAbout\nPress\nWork Here\nLegal\nPrivacy Policy\nTerms of Service\nContact Us\nCookie Settings\nCookie Policy\nSTACK EXCHANGE NETWORK\nTechnology\nCulture & recreation\nLife & arts\nScience\nProfessional\nBusiness\nAPI\nData\nBlog\nFacebook\nTwitter\nLinkedIn\nInstagram\n\nSite design / logo © 2024 Stack Exchange Inc; user contributions licensed under CC BY-SA. rev 2024.7.31.13445"
}
