{
  "link": "https://meta.stackexchange.com/questions/401841/weve-made-changes-to-our-terms-of-service-privacy-policy-july-2024?cb=1",
  "content": "Skip to main content\nLog in\nSign up\nHome\nQuestions\nTags\nUsers\nUnanswered\nTEAMS\n\nNow available on Stack Overflow for Teams! AI features where you work: search, IDE, and chat.\n\nLearn more Explore Teams\nWe've made changes to our Terms of Service & Privacy Policy - July 2024\nAsk Question\nAsked today\nModified today\nViewed 455 times\n17\n\nWe’ve just made two adjustments to our Terms of Service & Privacy Policy:\n\nFor the Terms of Service, we moved Copyright and DMCA information to a dedicated page.\nFor the Privacy Policy, we updated some language, and added the Teams Integrations Notice in there; we also removed an old policy for an old product that was now a deadlink.\n\nTerms of Service changes:\nThe entire section “11. Copyright Policy” has been changed to a summary and instead links to our specific DMCA takedown page that has further instructions on filing claims and counterclaims. It now reads:\n\nIf You believe that content residing or accessible on the Network infringes a copyright, please contact us in accordance with the reporting requirements outlined in our Digital Millennium Copyright Act Takedown Notice. Note that we reserve the right to pursue legal action for submitting false or frivolous notices of copyright infringement. As such, please consider all circumstances prior to submitting your request, including fair use and other licensing exceptions and limitations. We also reserve the right, at our discretion, to immediately suspend or terminate the account of any user who is the subject of repeated valid takedown notices.\n\nPrivacy Policy Changes:\nIn the “INTRODUCTION TO OUR PRIVACY POLICY” section, we've made a few minor changes.\n\nUsed to read\tNow reads\nWe have set out below an overview of how our privacy notices work. Depending on how you interact with us, we will collect and process your personal information as shown below.\tWe have set out below an overview of how our privacy notices work. Depending on how you interact with us, we will collect and process your personal information in accordance with this Privacy Policy and any applicable other privacy notice(s).\nIf you interact with us through our Collectives on Stack Overflow product, please read the Collectives Privacy Notice.\tIf you interact with us through our Collectives on Stack Overflow, please read the Privacy Notice for Collectives.\nFor Teams Free, Basic, Business: Please read the Privacy Notice for Stack Overflow Teams Free, Basic and Business. For Teams Enterprise: Please read the Privacy Notice for Stack Overflow Teams Enterprise.\tIf you interact with us through your organization’s Private Network on Stack Overflow for Teams and/or through one of our Stack Overflow for Teams Integrations, we will only process certain information as described in our Stack Overflow for Teams Privacy Notice and our Stack Overflow for Teams Integrations Privacy Notice, respectively.\nPlease read the Privacy Notice for Stack Overflow Talent and Jobs.\tThis line has been removed.\n\nThese are the extent of the changes made today.\n\nWe are still working on a bigger overhaul of the entire Privacy Policy; I know it's been a wait, but we still want to make several fixes and edits there.\n\ndiscussionfeaturedlegalprivacyterms-of-service\nShare\nImprove this question\nFollow\nedited 5 hours ago\nV2Blast\n7,5254\n4 gold badges\n37\n37 silver badges\n77\n77 bronze badges\nasked 8 hours ago\nCesar MStaffMod\n21.9k15\n15 gold badges\n71\n71 silver badges\n83\n83 bronze badges\nCould you elaborate on the nature of the bigger overhaul mentioned at the end? Is it a more an \"improving of wording\", \"updating to comply with law changes\" or \"actual changing of the privacy policies\"? – \nA-Tech\n \nCommented\n8 hours ago\n8\n@A-Tech it's an overhaul to improve readability and understanding. The goal is to make it more accessible to be read, so more in line of \"improving of wording\". – \nCesar M\nStaff\nMod\n \nCommented\n8 hours ago\n8\n@CesarM Does \"improve readability and understanding\" mean we're getting some clarity on whether the company is selling our information? meta.stackexchange.com/questions/401506/… – \nvandench\n \nCommented\n8 hours ago \n3\n@vandench I'm still working to getting an answer on that one independently of the privacy policy updates, as I answered in the comments there. – \nCesar M\nStaff\nMod\n \nCommented\n8 hours ago\n@CesarM While you're here is there any update on said inquiry/when we will get an answer? – \nA-Tech\n \nCommented\n8 hours ago\n5\n@A-Tech no, still WIP no date I can commit to. Still want to answer it though and still planned to. It's sort of similar to the GA cookie situation where it needed to work with the privacy, legal, and product teams to get to a comprehensive answer that was a true representation of current practice (keep in mind sale is quite a broad term legally). So it may be a while before I can commit to a timeline. It's being worked on, though. – \nCesar M\nStaff\nMod\n \nCommented\n8 hours ago \n7\nWas the line \"Note that we reserve the right to pursue legal action for submitting false or frivolous notices of copyright infringement\" added as a passive aggressive threat about the ongoing unanswered community concerns about the existence and nature of the \"second license\" and its effect in regard to the change in the data dump distribution and possible violations of the creative common license? – \nSPArcheon - on strike\n \nCommented\n7 hours ago \n7\n@SPArcheon-onstrike uh, no? these edits were drafted in 2023. – \nCesar M\nStaff\nMod\n \nCommented\n7 hours ago \n@CesarM \"no date I can commit to\" is… not entirely reassuring. The company has a hard deadline (a little over two weeks, now) to provide a truthful answer to those who have asked: it can't wait until you have the answer we all want. Any organisation processing personal data under GDPR is obliged to know what it's using it for and why, so this is a \"simple request\". (I'm not saying this to pressure anyone: I respect those I know who will be working on this. But if the answer remains \"we don't know\", we're going to have to hear it. Management have to be held accountable sooner or later.) – \nwizzwizz4\n \nCommented\n23 mins ago \nAdd a comment\n2 Answers\nSorted by:\nHighest score (default)\nDate modified (newest first)\nDate created (oldest first)\n12\n\nMaybe a nitpick, but...\n\nIf you interact with us through your organization’s Private Network on Stack Overflow for Teams [...]\n\nHow does this apply to users that use Stack Overflow for Teams instances (SOfT) set up by SE, Inc. who are not employed by SE, Inc.? It's not clear to me what \"your organization\" means for users who are not employees of said organization.\n\nI'm not a lawyer and this isn't legal advice, but I'm wondering how that would apply to, for example, Stack Moderators SOfT, as the mod agreement states mods are \"not an employee, agent, or representative of Stack\". (same question for users who are not mods, yet still use SOfT instances created by SE, Inc. for SE-related purposes). Maybe it should say something to cover Teams where the end-user isn't (legally) part of the organization that created it...?\n\nShare\nImprove this answer\nFollow\nedited 7 hours ago\nanswered 7 hours ago\ncocomac\n14.5k6\n6 gold badges\n30\n30 silver badges\n85\n85 bronze badges\nAdd a comment\n-7\n\nIf I came across this in the suggested edit review queue I'd be inclined to choose:\n\nReject\n\nNo improvement\n\nThe edit does not improve the quality of the post. Changes to the content are unnecessary or make the post more confusing.\n\nIn my opinion something more substantial is needed.\n\nShare\nImprove this answer\nFollow\nanswered 2 hours ago\nbad_coder\n27.5k7\n7 gold badges\n50\n50 silver badges\n129\n129 bronze badges\n4\nThe user has more than 2k rep, no reviews are needed. Jokes aside, I don't get your point here. Are you against any of the changes (besides some housekeeping, nothing important changes IMO)? Do you think something is missing? Do you consider this to make the help page harder to navigate (making it \"more confusing\")? Would you elaborate on what you mean by \"something more substantial\"? p.s. I haven't downvoted yet, waiting to understand your POV better, but I understand the downvotes. – \nM-- Save the Data Dump\n \nCommented\n2 hours ago \n3\nRemoving a dead link qualifies as an edit that improves the quality of a post. – \nSonic the Anonymous Hedgehog\n \nCommented\n1 hour ago\nAdd a comment\nYou must log in to answer this question.\nNot the answer you're looking for? Browse other questions tagged discussionfeaturedlegalprivacyterms-of-service.\nWelcome!\nWelcome! Meta Stack Exchange is intended for bugs, features, and discussions that affect the whole Stack Exchange family of Q&A sites.\nAbout\nHelp\nFeatured\nUpcoming initiatives on Stack Overflow and across the Stack Exchange network...\nAnnouncing a change to the data-dump process\nWe've made changes to our Terms of Service & Privacy Policy - July 2024\n6 people chatting\nTavern on the Meta\n7 mins ago - Journeyman Geek\nMeta Stack Exchange Comment Archive\n8 mins ago - Boson - StandWithUkraine\nLinked\n195\nWhy is the Google Analytics cookie defined as \"strictly necessary\" and saved without consent?\n70\nIs the company selling our Personal Information or not?\nRelated\n219\nPlease upload DMCA takedowns to the Chilling Effects Clearinghouse / Lumen Database\n2818\nA Terms of Service update restricting companies that scrape your profile information without your permission\n337\nBrace yourselves: The GDPR is coming!\n2571\nFiring mods and forced relicensing: is Stack Exchange still interested in cooperating with the community?\n2376\nStack Overflow is doing me ongoing harm; it's time to fix it!\n150\nUpdates to Privacy Policy (September 2021)\n90\nWe’ve made changes to our Terms of Service & Privacy Policy - January 2022\n730\nStack Exchange Public Q&A access will not be restricted in Russia\n1193\nModeration Strike: Stack Overflow, Inc. cannot consistently ignore, mistreat, and malign its volunteers\n793\nModeration strike: Results of negotiations\nHot Network Questions\nHot wires connected together and the neutrals go to the switch\nHow Does Our Current Understanding of QFT Affect Chemistry and Biology?\nIs this carbon fork damaged?\nDraw Small Regular Polygons\nIs doping still a thing in pro cycling (2024)?\nIs this a valid Irish word?\nDouble Grid Miracle Sudoku\nWhat is the History of the books Derech HaChaim and Netiv HaChaim?\nHow to limit the number of files printed by ls and print them in columns like ls prints normally?\nShould I drop a semester due to medical reasons\nWhen non-resident US citizens vote, which state does their vote count for wrt the electoral college?\nPython Regex to match the FIRST repetition of a digit\nFinding a story: Space travel in canoes, automated self-healing houses\nHow long should I boil a liquid mixture containing vanilla extract to vaporize the alcohol, when making ice cream?\nQuestion about Bochner measurability\nWhat is the best way to close this small gap in the tile?\nHandmade number sequence puzzle - but I broke it!\nAre there non-religious variants of moral realism that defend the existence of objectively evil thoughts, intentions, and desires?\nFor a normed vector space, does there exists minimal dense subspace(s)?\nMinerals in asteroids that can only be detected indirectly\nAre elements above 137 possible?\nHow do I know when I have sufficiently mastered a right hand speed drill for accordion?\nHow will a very short undergrad impact PhD applications?\nIs it illegal in Australia to add \"chocolate or sultanas\" to an Anzac biscuit?\n Question feed\nMETA STACK EXCHANGE\nTour\nHelp\nChat\nContact\nFeedback\nCOMPANY\nStack Overflow\nTeams\nAdvertising\nCollectives\nTalent\nAbout\nPress\nLegal\nPrivacy Policy\nTerms of Service\nCookie Settings\nCookie Policy\nSTACK EXCHANGE NETWORK\nTechnology\nCulture & recreation\nLife & arts\nScience\nProfessional\nBusiness\nAPI\nData\nBlog\nFacebook\nTwitter\nLinkedIn\nInstagram\n\nSite design / logo © 2024 Stack Exchange Inc; user contributions licensed under CC BY-SA. rev 2024.7.31.13445\n\nBy clicking “Accept all cookies”, you agree Stack Exchange can store cookies on your device and disclose information in accordance with our Cookie Policy.\nAccept all cookies\nNecessary cookies only\nCustomize settings"
}
