{
  "link": "https://developer.dhl.com/",
  "content": "Skip to main content\nMAIN NAVIGATION\nAPIs \nDocumentation\nHelp Center\nEN \nRegister\nLogin\nDHL FOR DEVELOPERS\nMODERN REST APIS, SIMPLY DELIVERED\n\n \n\nSign up\n \nBrowse our APIs\nOUR SERVICES\n\nDig into our API reference documentation and quickstarts.\n\nTRACKING\n\nReceive your shipment status\n\nBrowse Tracking APIs\n\nSHIPPING\n\nCreate your shipments including labels\n\nBrowse Shipping APIs\n\nFURTHER SERVICES\n\nBrowse our whole API catalog\n\nBrowse All Services\n\nABOUT DHL API DEVELOPER PORTAL\n\nThe DHL Developer Portal is DPDHL's single point of contact for access to APIs from all its business divisions, allowing to signing up for them and making them easy to consume. \n\nCheck the API Catalog to see the APIs already released on this portal. Further APIs from other DPDHL divisions will be added in the coming months. \n\n \n\nSign up\n \nLearn more\nNEED HELP?\n\nProblems to register in the portal?\nWhat standards do the DHL APIs follow?\nCheck the frequently asked questions\n\nHelp Center\nFind Content\nSearch\nSearch\nAPIs of our divisions\nDHL eCommerce\nDHL Express\nDHL Global Forwarding\nDHL Freight\nDHL Supply Chain\nPost & Parcel Germany\nDevelopers\nAPI Catalog\nDocumentation\nAPI Status\nFOOTER MENU\nImprint\nPrivacy Notice\nTerms of Use\nCookie Settings\n2024 © DHL International GmbH. All rights reserved.\nPrivacy Preference Center\n\"Cookies\" are small files that enable us to store information related to your device and you, the user, specifically, while you visit one of our websites. Cookies help us to determine how frequently our internet pages are accessed as well as the number of users. And they help us configure our offers so that they are as convenient and efficient as possible for you. Privacy Notice\nAccept All\nConfirm Selection\nManage Consent Preferences\nStrictly Necessary Cookies\nAlways Active\n\nThese cookies are used to ensure that our website operates correctly and they cannot be deactivated in your systems.\n\nCookies Details‎\nPerformance Cookies\n\nThese cookies collect information about the way our website is used, such as the Internet browser and operating system used, domain name of the website from which you accessed our site, number of visits, average time spent on the site and pages viewed.\n\nCookies Details‎\nFunctional Cookies\n\nThese cookies allow the website to remember choices you make and provide enhanced, more personal features. For example, these cookies can be used to remember and store the last tracking number that you entered when using a tracking application. Information these cookies collect may be anonymized and they cannot track your browsing activity on other websites.\n\nCookies Details‎\nAnalytics Cookies\n\nWe use analytical cookies to improve the quality of our website and its content, and to ensure that our partners’ embedded services work properly.\n\nCookies Details‎\nConfirm Selection"
}
