{
  "link": "https://developer.dhl.com/dhl-ecommerce",
  "content": "Skip to main content\nMAIN NAVIGATION\nAPIs \nDocumentation\nHelp Center\nEN \nRegister\nLogin\nSearch API\nclear all filters\nRecommended\nDivision\nDHL eCommerce\nDHL Express\nDHL Freight\nDHL Global Forwarding\nDHL Supply Chain\nPost & Parcel Germany\nService type\nInformation\nLocation\nShipping\nTracking\nRegion\nBROWSE APIS\nLocation Finder - Unified\n\nBest for:\n\nFinding all DHL pick-up and drop-off points to send and receive packages\nIntegrating multiple types of Deutsche Post DHL locations\nLocations in Germany and many countries worldwide\nUsed for: Location\nShipment Tracking - Unified\n\nBest for:\n\nProviding access to the shipment status at any time\nIntegrating all types of DHL shipments\nMultiple shipments (e.g. eCommerce, Express, Freight, Letter, Parcel, etc.)\nRegion: Global\nUsed for: Tracking\nBlue Dart-Alt-Instruction\nBest for:\n\nThis service is used to update Alt Instruction for Waybill number. Few Alternative instruction are RTO which is Cancel Waybill for a shipment and all.\n\nCustomer Alt-Instruction Update :\n\nThis service provide us the information to Update Alternate instructions for a Waybill number. Alternate instructions are RTO of a shipment, Reattempt for delivery, Escalation Delivery, Land Mark Change and Alternate Mobile.\n\nRegion: India\nBlue Dart-Location Finder\nBest for:\n\nThe Location Finder provides you with information on locations serviced by Blue Dart. It also outlines the services available for each location. This service can be used by the customer to be better advised on the serviceability and reach of Blue Dart locations. This query input is based on pin code.\n\nGet Service for Pin-code :\n\nThis method will return information about all types of services provided by Blue Dart for requested pin code.\n\nGet Service for Product:\n\nThis method will return service availablity for requested pincode,product / subproduct.\n\nGet Service for Pincode and Product:\n\nThis method will return service availablity for requested pincode,product / subproduct.\n\nRegion: India\nUsed for: Information\nBlue Dart-Master Download\nBest for:\n\nThis API exposes methods those will be used for masters download. It will downloads incremental pin code master changes\n\nDownload Pincode Master :\n\nDownlaod-Pincode-Master service will help us to downloads incremental pin code master changes\n\nRegion: India\nBlue Dart-Pickup Cancellation\nBest for:\n\nThe Cancel Pickup registration API exposes methods which will be used to cancel a Pickup. This Service provide the flexibility to registered customer to cancel its Shipment pickup\n\nCancel Pickup Registration :\n\nThis service will allow customer or user to cancel a pickup for its shipment. Canceling of pickup will be applicable to customer who are registered for the shipment order to Pickup.\n\nThe customer will use detail along with additional information related to shipment as token number and pickup registration date for its shipment order.\n\nRegion: India\nBlue Dart-Product and Sub-Product Pickup Detail\nBest for:\n\nThe product and Sub-Product Pickup Detail registration API exposes methods which will be used to get detail of a Pickup. This Service provide the flexibility to customer to cancel its get the detail of the pickup\n\nGet All Products and Sub-Products:\n\nThis method will return all product & subproduct codes details that will be used to send as input parameters in Pickup Registration method.\n\nThis service will allow customer provides all product & subproduct details for its shipment.\n\nRegion: India\nBlue Dart-Registration for Pickup\nBest for:\n\nThe registration pickup API provides the flexibility for the Blue Dart customer to register themself for pick up the shipment order.\n\nRegister Pickup:\n\nThis service will allow customer for Registering their pickup for its shipment. Registration of pickup will be applicable to customer to provide details like Area, Product, Customer Name, Address, Telephone details, etc. The response for the product provides Token Number for the registered shipment and Status of the order.\n\nRegion: India\nBlue Dart-Tracking Of Shipment\nBest for:\n\nThe API provide customer with all detail information and status of their shipment.\n\nShipment Detail:\n\nThis operation will return all the information of customer shipment.\n\nShipment Status:\n\nThis operation will provide us all the status information of customer shipment.\n\nRegion: India\nBlue Dart-Transit Time\nBest for:\n\nThe Transit Time Finder provides user with the delivery date for a selected service. The detail which are required to provide the Blue Dart service required, the Origin pin code, Destination pin code, pickup date and time.\n\nGetDomesticTransitTimeForPinCodeandProduct :\n\nThis method will return Expected delivery date of the shipment when it is shipped on a certain date for a selected service.\n\nRegion: India\nBlue Dart-Waybill\nBest for:\n\nThis service is used to generate, update, cancel and import Waybill.\n\nGenerate WayBill (Single Waybill Generation):\n\nThis method will generate Waybill using all necessary data as input parameters.\n\nImport data (Multiple Waybill Generation):\n\nThis method will generate multiple Waybill using all necessary data as input parameters.\n\nUpdate EWaybill :\n\nProvision to update Ewaybill number generated by customer against blue dart waybill numbers.\n\nCancel Waybill :\n\nThis method will cancel Waybill request before Shipment Manifest (In-scan).\n\nRegion: India\nDHL eCommerce Europe\n\nBest for:\n\nShipping of Parcel Connect, Parcel Return Connect and Parcel Connect PLUS \nCreating cross-border & direct injection shipments within Europe\nLarge business customers of DHL eCommerce in Europe\nSending shipments within Europe and from Europe (excl. DE) into Rest of World\nRegion: Europe\nUsed for: Shipping\nParcel EU (BE - LU - NL)\n\nBest for:\n\nCreating labels for domestic and international shipments\nUsers with a DHL Parcel EU entity customer account\nSending shipments in selected EU countries and from them worldwide\nRegion: Belgium, Luxembourg, Netherlands\nUsed for: Information\nParcel UK\nEarly Access\n\nBest for:\n\nParcel UK shipping and tracking\nCreating Domestic (UK) and International parcel shipments (UK pickup) \nRetrieving product and service information, which can be used to integrate and enrich your own IT fulfilment systems\nRegion: United Kingdom\nUsed for: Information\nFind Content\nSearch\nSearch\nAPIs of our divisions\nDHL eCommerce\nDHL Express\nDHL Global Forwarding\nDHL Freight\nDHL Supply Chain\nPost & Parcel Germany\nDevelopers\nAPI Catalog\nDocumentation\nAPI Status\nFOOTER MENU\nImprint\nPrivacy Notice\nTerms of Use\nCookie Settings\n2024 © DHL International GmbH. All rights reserved."
}
