{
  "link": "https://developer.dhl.com/help-center",
  "content": "API Developer Portal - Help Center\nWelcome\nLogin\nHelp Center Home\nKnowledge Base\nHow can we help you today?\n \nLogin\nto submit a new ticket\n Check Ticket Status\nKnowledge base\nFAQs\nGeneral 11\nWhat is a Unified API?\nWhat is the DHL Group?\nWhat is DHL Express?\nWhat is DHL Global Forwarding?\nWhat is DHL eCommerce?\nSee all 11 articles\nAPI access and usage conditions 9\nI'm new to APIs. Is there a place where I can check how the API works?\nMy API request is still pending, how long does it take to approve my API request?\nDo I need to be a DPDHL customer to use DPDHL APIs?\nI am a DPDHL customer, where can I find my DPDHL account number?\nIs there a fee for using DPDHL's APIs?\nSee all 9 articles\nDeveloper Portal registration and usage 5\nProblems registering in the portal?\nWhat's a Developer App?\nHow to create an App?\nWhich APIs have the self-service API onboarding available?\nIs it possible to change email address registered in the Developer Portal?\nShipping APIs (Which API you should use) 3\nFor Parcels/Packages\nFor Mails/letters\nFor Freight/Cargo\nShipment Tracking Unified API 32\nIs it possible to track more than one tracking number in one API call?\nProof of delivery (POD) does not appear in the body response when calling the Shipment Tracking - Unified API\nHow to add my API Key on Postman to test the Shipment Tracking - Unified API?\nI receive an \"Unauthorized\" response when I make a request to Shipment Tracking - Unified API on a web browser\nWhat are the different status codes available in the DHL Shipment tracking - Unified API?\nSee all 32 articles\nMyDHL Express API 9\nI have a DHL Express account number. How can I use the Express API?\nI do not have a DHL Express account number. How can i use the Express API?\nI’m not a DHL Express customer, Can I test the MyDHL Express API?\nI tried to test the MyDHL Express API on the developer portal but didn’t work?\nHow to authorize a MyDHL Express API call using the API key on Postman?\nSee all 9 articles\nLocation Finder - Unified API 10\nI'm getting a 200 empty response that says \"locations\": []\nWhat is the difference between the locationType parameter options?\nWhen extracting locations through the API for customer parcel drop-off points, we encounter duplicated locations, how can I remove them?\nCan I validate postal codes through this API?\nCan I have a higher quota than 500 calls per day?\nSee all 10 articles\nHelp Center Home Knowledge Base\nImprint | Privacy Notice | Terms of Use\n\n2022 © DHL International GmbH. All rights reserved."
}
