{
  "link": "https://developer.dhl.com/post-and-parcel-germany",
  "content": "Skip to main content\nMain navigation\nAPIs \nDocumentation\nHelp Center\nEN \nRegister\nLogin\nPost & DHL Germany\nAPIs for developers\n\n \n\nBrowse our Post APIs       Browse our Parcel APIs\n\nWith Deutsche Post & DHL APIs, you can quickly and easily use our solutions for logistics and dialog marketing and extend your web services with useful information. Using our APIs, you can create shipping labels and Internet stamps, query shipment status or integrate our services into your online store.\n\nEasy-to-use step-by-step instructions guide you through the entire connection process. Detailed documentations, code examples and extensive FAQs on the respective API pages will help you with the integration.\nFor more in-depth questions, you can also contact our support team.\n\nParcel APIs\n\nAuthentication API (Post & Parcel Germany)\nAvailable\n\nPOST & PARCEL GERMANY: For Business Customers of Parcel Germany.\n\nRegion: Germany\nUsed for: Account\nDHL Parcel DE Pickup (Post & Parcel Germany)\nAvailable\n\nBest for:\n\nPlace free or chargeable pick-up orders via web service.\nRegion: Germany\nUsed for: Transportation\nDHL Parcel DE Returns (Post & Parcel Germany)\nAvailable\n\nBest for:\n\nCreation of return labels to be used by end customers\nReturns sender countries: bgr, dnk, deu, est, fin, fra, grc, gbr, irl, ita, hrv, lva, ltu, lux, mlt, nld, aut, pol, prt, rou, swe, che, svk, svn, esp, cze, hun, cyp\nDetermination of receiver configuration for your account\nRegion: Germany\nUsed for: Shipping\nDHL Parcel DE Shipping (Post & Parcel Germany)\nAvailable\n\nBest for:\n\nBusiness customers of Post & Parcel Germany\nCreate and manage shipment labes for domestic and international Parcels\nRegion: Germany\nUsed for: Shipping\nDHL Parcel DE Tracking (Post & Parcel Germany)\nAvailable\n\nBest for:\n\nWith the DHL shipment tracking API pivate and business customers can query the shipment status and history of shipments at any time.\n\nRegion: Germany\nUsed for: Tracking\nParcel DE Postnumber (Post & Parcel Germany)\nAvailable\n\nBest for:\n\nValidate postnumbers to ensure deliverability of shipments to the corresponding person at Packstation parcel lockers.\nRegion: Germany\nUsed for: Address, Shipping\nPost APIs\n\nDATAFACTORY AUTOCOMPLETE 2.0 (Post & Parcel Germany)\nPlanned\n\nAutomatic completion of postal data\n\nBest for:\n\nMore user friendly than ever with fast and convenient address entry\nAccurate address data from initial contact\nFewer returns thanks to correct postal data\nSimplified generation of routing codes with DHL-compliant data\nRegion: Germany\nUsed for: Address\nDeutsche Post International (Post & Parcel Germany)\nAvailable\n\nBest for:\n\nCreating labels for international mail, lightweight items and merchandise\nEuropean Business Customers sending worldwide\nRegion: Europe\nUsed for: Shipping, Tracking\nDeutsche Post INTERNETMARKE (Post & Parcel Germany)\nAvailable\n\nThe INTERNETMARKE is the online-postage for mail products of Deutsche Post AG.\n\nBest for:\n\nCreation, purchase and payment of the following mail products:\n\npostcards and letter mails domestic (with additional services Prio, registered mail, registered mail with personal delivery and return slip) \npostcards and letter mails international (with additional services registered mail, personal delivery)\ndomestic shipments of books and goods \nUsed for: Shipping\nMail Communication Tracking Push (Post & Parcel Germany)\nAvailable\n\nBest for:\n\nBusiness Customers using Mail Communication Services (discounted rate) (Verfolgen Brief Teilleistungen)\nSubscribing to DPDHL Mail Communication Tracking Push API\nRegister for Push API subscription\nProvide your client URL and business customer portal user\nStart receiving daily mail shipment status pushed from DPDHL to your endpoint\nRegion: Germany\nUsed for: Tracking\nOrder Management (AM)\nAvailable\n\nBest for:\n\nBusiness customers of Deutsche Post AG\nElectronic order management of Deutsche Post AG's commercial and logistics processes (Mail)\nRegion: Germany\nUsed for: Shipping\nPrint-Mailing Automation API\nAvailable\n\nThis API is used for creating and managing Print-Mailing campaigns as well as automated, trigger-based sending of recipient information through 3rd party Marketing Automation Systems.\n\nThe Print-Mailing API features:\n\nCreating and managing campaigns\nDesigning campaigns with a maximum of individualization\nHigh quality printing\nBest in class delivery by Deutsche Post\nRegion: Germany\nUsed for: Shipping, Advertising\nPrint-Mailing Dispatch Preparation API\nAvailable\n\nThis API is used for dispatching Dialogue Marketing print mailings.\n\nCalculate and optimize prices\nCreate shipping documents\nFranking\nPlace and change your order\nUse an easy way for dispatch preparation in your software\nRegion: Germany\nUsed for: Shipping, Advertising\nPrint-Mailing Targeting API\nAvailable\n\nThis API is used for planning Dialogue Marketing print mailings.\n\nPlan new target groups and\nSelect target areas.\nGet possible options for your print mailing directly and\nReceive relevant recipient data for the dispatch preparation.\nRegion: Germany\nUsed for: Shipping, Advertising\nGroup APIs\nShipment Tracking - Unified\nRecommended\n\nBest for:\n\nProviding access to the shipment status at any time\nIntegrating all types of DHL shipments\nMultiple shipments (e.g. eCommerce, Express, Freight, Letter, Parcel, etc.)\nRegion: Global\nUsed for: Tracking\nDuty and Tax Calculator - Unified\nAvailable\n\nPurpose\n\nCalculates the duties, taxes and governmental fees for any international shipment, taking into consideration country de minimis values and preferential tariff rates that may apply. The Duty and Tax Calculator API does not provide shipping rates, but instead uses the shipping rate charged to the consignee as an input.\n\nWorks with\nAny carrier, not just DHL, and have a Worldwide scope (if you are a DHL Express customer, please use the DHL Express - MyDHL API)\n\nFree 30-day trial\nGet immediate access and 30 days of free calculations (API calls).\n\nRegion: Global\nUsed for: Additional Services\nLooking for other Post and DHL Germany APIs?\n\nYou can also find the documentation for older Post & DHL APIs here in the Group API Developer Portal (GDP). Access to this can be provided to you free of charge. Please register for GDP and then contact our support team. \n\nOn this info page you will find brief instructions and FAQs after switching to the new Group API Developer Portal in 2023.\n\nDo you have further questions? Please refer to the latest FAQs:\n\nI'm not sure which API to use.\n\nWhat happens to Post and DHL Entwicklerportal?\n\nHow do I get informed about IT-service and API incidents?\n\nHow do I use the Postman Test Collection\n\nFind Content\nSearch\nSearch\nAPIs of our divisions\nDHL eCommerce\nDHL Express\nDHL Global Forwarding\nDHL Freight\nDHL Supply Chain\nPost & Parcel Germany\nDevelopers\nAPI Catalog\nDocumentation\nAPI Status\nFooter menu\nImprint\nPrivacy Notice\nTerms of Use\nCookie Settings\n2024 © DHL International GmbH. All rights reserved."
}
