{
  "link": "https://developer.fedex.com/api/en-us/organization/create.html#/createorganization",
  "content": "Menu\n Developer Portal\n\nAre you joining from FedEx Web Services? Welcome!\n\nStarting on August 31, 2024, you will no longer be able to use FedEx Web Services Tracking, Address Validation, and Validate Postal Codes. This is because SOAP based FedEx Web Services is now in development containment and has been replaced with FedEx RESTful APIs. You can learn more about how to upgrade your integration to FedEx APIs here on the FedEx Developer Portal.\n\nYour business, powered by FedEx\n\nOur shipping integration solutions help connect your current business application with FedEx logistic solutions.\n\n\nWith a full suite of modern APIs and our Shipment Visibility Webhook, we have software solutions to support all your needs.\nIt’s your business. Done better.\n\nSIGN UP LOG IN\nGet near real-time Shipment Visibility Webhook\n\nFedEx Shipment Visibility Webhook delivers near real-time tracking push notifications directly to your servers. You get timely shipment visibility and best-in-class recipient tracking  - with a flexible solution you can configure to meet your unique business needs. Subscribers are charged a monthly fee, based on the count of tracking number(s). \n\nEXPLORE THE BENEFITS\nNo matter your needs, our solutions deliver\n\nFedEx APIs and webhooks offer a simple, cost-effective way to keep customers on your site and add speed and efficiency to your shipping process.\n\nStreamline processes\nAccess customized, interface-independent integration solutions.\nImprove efficiency\nManage returns with ease and reduce customer service costs.\nSupport customers\nAllow customers to track the status of their orders, all in your own application.\nLeverage FedEx solutions with our full suite of webhooks and APIs\nAPIs\n\nPull information from FedEx logistic solutions into your own applications to compare rates, create labels, process returns, and more. \n\nMOST POPULAR APIS\n\n• Track API\n\n• Ship API\n\n• Rate and transit time\n\nEXPLORE API CATALOG\nShipment Visibility Webhook\n\nGet near real time push updates on shipments in transit for US-based accounts and tracking numbers . Track events include estimated date of delivery and time window, picture proof of delivery and more. Subscribers are charged a monthly fee, based on the count of tracking number(s).\n\n\n\n\n\nCOMING SOON\n\nTracking number-based webhooks\nEXPLORE DOCUMENTION\n\nLEARN ABOUT THE BENEFITS\n\nTest before you commit, and integrate with ease\nTest\n\nExplore documentation for Shipment Visibility Webhook and our API solutions, then test in our sandbox space— no account needed.\nShipment Visibility Webhook Documentation\nAPI Catalog\n\nLearn\n\nReview our quotas and rate limits guide and integration best practices to learn about solutions in more detail.\nQuotas & rate limits guide\nIntegration best practices\n\nIntegrate\n\nReady to integrate? Follow our step-by-step getting started guide, and start by creating an organization in the FedEx Developer Portal.\nGetting started guide\nCreate Organization\n\nEnsure integration is a good fit for  your business?\n\nFedEx Compatible\n\nIf your shipping application is intended for resale, become a member of FedEx® Compatible to integrate FedEx functionality into your solution.\n\nEXPLORE FEDEX COMPATIBLE\n\nSolutions to support your business\n\nNot sure if you're ready to integrate with FedEx solutions? Learn more about how integrating can support your business.\n\nEXPLORE SOLUTIONS\nWhat is an API and what are the benefits ?\nDo I need a FedEx account for integrations?\nVIEW ALL FAQS\n\nAre you an existing Web Services or FedEx Ship Manager Server Customer? If so, you can still access the Developer Resource Center.\n\n © FedEx Corporate Services Inc. All rights reserved.\nIntegration Solutions Support FedEx.com Terms of Use Security & Privacy\n United States \nEnglish"
}
